<?php ## Упаковка пяти значений в целое число
  // Прямоугольник
  define('RECTANGLE', 2); // 000000000 000000000 000000000 000 10
  // Зеленый
  define('GREEN', 8);     // 000000000 000000000 000000000 010 00
  // Угол на 45 градусов
  $angle = 45 << 5;       // 000000000 000000000 000101101 000 00
  // Высота
  $height = 15 << 14;     // 000000000 000011110 000000000 000 00
  // Ширина
  $width = 15 << 23;      // 000001111 000000000 000000000 000 00
  // Результат
  echo RECTANGLE | GREEN | $angle | $height | $width; // 126076330
?>